In [1]:
#1.3.2
import pandas as pd

In [2]:
names_dict = {"names":
        [
            "Tom",
            "Mary",
            "Jeff",
            "Rose",
            "Stephanie",
            "Rodger"
        ]}

In [3]:
print (names_dict["names"])

['Tom', 'Mary', 'Jeff', 'Rose', 'Stephanie', 'Rodger']

In [4]:
df = pd.DataFrame(names_dict)

In [5]:
df

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

In [6]:
print (df)

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

In [7]:
df.to_csv("data/names.csv")

In [8]:
df2 = pd.read_csv("data/names.csv")

In [9]:
df2

   Unnamed: 0      names
0           0        Tom
1           1       Mary
2           2       Jeff
3           3       Rose
4           4  Stephanie
5           5     Rodger

In [10]:
df

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

In [12]:
df.to_csv("data/names_no_index.csv", index=False)

In [13]:
df3 = pd.read_csv("data/names_no_index.csv")

In [14]:
df3

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

In [15]:
df3.to_json("data/names.json")

In [21]:
df4 = pd.read_json("data/names.json")

In [22]:
df4

       names
0        Tom
1       Mary
2       Jeff
3       Rose
4  Stephanie
5     Rodger

In [24]:
df4["ages"] = [20, 26, 20, 18, 52, 40]

In [25]:
df4

       names  ages
0        Tom    20
1       Mary    26
2       Jeff    20
3       Rose    18
4  Stephanie    52
5     Rodger    40

In [26]:
names = df4.names

In [27]:
names

0          Tom
1         Mary
2         Jeff
3         Rose
4    Stephanie
5       Rodger
Name: names, dtype: object

In [28]:
ages = df4.ages
ages

0    20
1    26
2    20
3    18
4    52
5    40
Name: ages, dtype: int64

In [29]:
ages_list = df4.ages.tolist()

In [30]:
print (ages_list)

[20, 26, 20, 18, 52, 40]

In [31]:
#iloc
row1 = df4.iloc[1]

In [32]:
row1

names    Mary
ages       26
Name: 1, dtype: object